Revit 2024 API
FilterStringRule.RuleString Property
 The user-supplied string against which strings from a Revit document will be tested.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public string RuleString { get; set; }
Visual Basic
Public Property RuleString As String
	Get
	Set
Visual C++
public:
property String^ RuleString {
	String^ get ();
	void set (String^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
FilterStringRule Class
Autodesk.Revit.DB Namespace